Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/0.1/PIC32MZDA/atdf/PIC32MZ1025DAB288.atdf
         <register caption="ADC Digital Comparator x Enable Register (x = 1 through 6)" name="ADCCMPEN3" offset="0x48" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CMPE0" />
            <bitfield mask="0x00000002" name="CMPE1" />
            <bitfield mask="0x00000004" name="CMPE2" />
            <bitfield mask="0x00000008" name="CMPE3" />
            <bitfield mask="0x00000010" name="CMPE4" />
            <bitfield mask="0x00000020" name="CMPE5" />
            <bitfield mask="0x00000040" name="CMPE6" />
            <bitfield mask="0x00000080" name="CMPE7" />
            <bitfield mask="0x00000100" name="CMPE8" />
            <bitfield mask="0x00000200" name="CMPE9" />
            <bitfield mask="0x00000400" name="CMPE10" />
            <bitfield mask="0x00000800" name="CMPE11" />
            <bitfield mask="0x00001000" name="CMPE12" />
            <bitfield mask="0x00002000" name="CMPE13" />
            <bitfield mask="0x00004000" name="CMPE14" />
            <bitfield mask="0x00008000" name="CMPE15" />
            <bitfield mask="0x00010000" name="CMPE16" />
            <bitfield mask="0x00020000" name="CMPE17" />
            <bitfield mask="0x00040000" name="CMPE18" />
            <bitfield mask="0x00080000" name="CMPE19" />
            <bitfield mask="0x00100000" name="CMPE20" />
            <bitfield mask="0x00200000" name="CMPE21" />
            <bitfield mask="0x00400000" name="CMPE22" />
            <bitfield mask="0x00800000" name="CMPE23" />
            <bitfield mask="0x01000000" name="CMPE24" />
            <bitfield mask="0x02000000" name="CMPE25" />
            <bitfield mask="0x04000000" name="CMPE26" />
            <bitfield mask="0x08000000" name="CMPE27" />
            <bitfield mask="0x10000000" name="CMPE28" />
            <bitfield mask="0x20000000" name="CMPE29" />
            <bitfield mask="0x40000000" name="CMPE30" />
            <bitfield mask="0x80000000" name="CMPE31" />
         </register>
         <register caption="ADC Digital Comparator x Enable Register (x = 1 through 6)" name="ADCCMPEN4" offset="0x50" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CMPE0" />
            <bitfield mask="0x00000002" name="CMPE1" />
            <bitfield mask="0x00000004" name="CMPE2" />
            <bitfield mask="0x00000008" name="CMPE3" />
            <bitfield mask="0x00000010" name="CMPE4" />
            <bitfield mask="0x00000020" name="CMPE5" />
            <bitfield mask="0x00000040" name="CMPE6" />
            <bitfield mask="0x00000080" name="CMPE7" />
            <bitfield mask="0x00000100" name="CMPE8" />
            <bitfield mask="0x00000200" name="CMPE9" />
            <bitfield mask="0x00000400" name="CMPE10" />
            <bitfield mask="0x00000800" name="CMPE11" />
            <bitfield mask="0x00001000" name="CMPE12" />
            <bitfield mask="0x00002000" name="CMPE13" />
            <bitfield mask="0x00004000" name="CMPE14" />
            <bitfield mask="0x00008000" name="CMPE15" />
            <bitfield mask="0x00010000" name="CMPE16" />
            <bitfield mask="0x00020000" name="CMPE17" />
            <bitfield mask="0x00040000" name="CMPE18" />
            <bitfield mask="0x00080000" name="CMPE19" />
            <bitfield mask="0x00100000" name="CMPE20" />
            <bitfield mask="0x00200000" name="CMPE21" />
            <bitfield mask="0x00400000" name="CMPE22" />
            <bitfield mask="0x00800000" name="CMPE23" />
            <bitfield mask="0x01000000" name="CMPE24" />
            <bitfield mask="0x02000000" name="CMPE25" />
            <bitfield mask="0x04000000" name="CMPE26" />
            <bitfield mask="0x08000000" name="CMPE27" />
            <bitfield mask="0x10000000" name="CMPE28" />
            <bitfield mask="0x20000000" name="CMPE29" />
            <bitfield mask="0x40000000" name="CMPE30" />
            <bitfield mask="0x80000000" name="CMPE31" />
         </register>
         <register caption="ADC Digital Comparator x Enable Register (x = 1 through 6)" name="ADCCMPEN5" offset="0x58" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CMPE0" />
            <bitfield mask="0x00000002" name="CMPE1" />
            <bitfield mask="0x00000004" name="CMPE2" />
            <bitfield mask="0x00000008" name="CMPE3" />
            <bitfield mask="0x00000010" name="CMPE4" />
            <bitfield mask="0x00000020" name="CMPE5" />
            <bitfield mask="0x00000040" name="CMPE6" />
            <bitfield mask="0x00000080" name="CMPE7" />
            <bitfield mask="0x00000100" name="CMPE8" />
            <bitfield mask="0x00000200" name="CMPE9" />
            <bitfield mask="0x00000400" name="CMPE10" />
            <bitfield mask="0x00000800" name="CMPE11" />
            <bitfield mask="0x00001000" name="CMPE12" />
            <bitfield mask="0x00002000" name="CMPE13" />
            <bitfield mask="0x00004000" name="CMPE14" />
            <bitfield mask="0x00008000" name="CMPE15" />
            <bitfield mask="0x00010000" name="CMPE16" />
            <bitfield mask="0x00020000" name="CMPE17" />
            <bitfield mask="0x00040000" name="CMPE18" />
            <bitfield mask="0x00080000" name="CMPE19" />
            <bitfield mask="0x00100000" name="CMPE20" />
            <bitfield mask="0x00200000" name="CMPE21" />
            <bitfield mask="0x00400000" name="CMPE22" />
            <bitfield mask="0x00800000" name="CMPE23" />
            <bitfield mask="0x01000000" name="CMPE24" />
            <bitfield mask="0x02000000" name="CMPE25" />
            <bitfield mask="0x04000000" name="CMPE26" />
            <bitfield mask="0x08000000" name="CMPE27" />
            <bitfield mask="0x10000000" name="CMPE28" />
            <bitfield mask="0x20000000" name="CMPE29" />
            <bitfield mask="0x40000000" name="CMPE30" />
            <bitfield mask="0x80000000" name="CMPE31" />
         </register>
         <register caption="ADC Digital Comparator x Enable Register (x = 1 through 6)" name="ADCCMPEN6" offset="0x60" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CMPE0" />
            <bitfield mask="0x00000002" name="CMPE1" />
            <bitfield mask="0x00000004" name="CMPE2" />
            <bitfield mask="0x00000008" name="CMPE3" />
            <bitfield mask="0x00000010" name="CMPE4" />
            <bitfield mask="0x00000020" name="CMPE5" />
            <bitfield mask="0x00000040" name="CMPE6" />
            <bitfield mask="0x00000080" name="CMPE7" />
            <bitfield mask="0x00000100" name="CMPE8" />
            <bitfield mask="0x00000200" name="CMPE9" />
            <bitfield mask="0x00000400" name="CMPE10" />
            <bitfield mask="0x00000800" name="CMPE11" />
            <bitfield mask="0x00001000" name="CMPE12" />
            <bitfield mask="0x00002000" name="CMPE13" />
            <bitfield mask="0x00004000" name="CMPE14" />
            <bitfield mask="0x00008000" name="CMPE15" />
            <bitfield mask="0x00010000" name="CMPE16" />
            <bitfield mask="0x00020000" name="CMPE17" />
            <bitfield mask="0x00040000" name="CMPE18" />
            <bitfield mask="0x00080000" name="CMPE19" />
            <bitfield mask="0x00100000" name="CMPE20" />
            <bitfield mask="0x00200000" name="CMPE21" />
            <bitfield mask="0x00400000" name="CMPE22" />
            <bitfield mask="0x00800000" name="CMPE23" />
            <bitfield mask="0x01000000" name="CMPE24" />
            <bitfield mask="0x02000000" name="CMPE25" />
            <bitfield mask="0x04000000" name="CMPE26" />
            <bitfield mask="0x08000000" name="CMPE27" />
            <bitfield mask="0x10000000" name="CMPE28" />
            <bitfield mask="0x20000000" name="CMPE29" />
            <bitfield mask="0x40000000" name="CMPE30" />
            <bitfield mask="0x80000000" name="CMPE31" />
         </register>
         <register caption="ADC Digital Comparator x Limit Value Register (x = 1 through 6)" name="ADCCMP1" offset="0x3c" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="DCMPLO" />
            <bitfield mask="0xFFFF0000" name="DCMPHI" />
         </register>
         <register caption="ADC Digital Comparator x Limit Value Register (x = 1 through 6)" name="ADCCMP2" offset="0x44" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="DCMPLO" />
            <bitfield mask="0xFFFF0000" name="DCMPHI" />
         </register>
         <register caption="ADC Digital Comparator x Limit Value Register (x = 1 through 6)" name="ADCCMP3" offset="0x4c" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="DCMPLO" />
            <bitfield mask="0xFFFF0000" name="DCMPHI" />
         </register>
         <register caption="ADC Digital Comparator x Limit Value Register (x = 1 through 6)" name="ADCCMP4" offset="0x54" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="DCMPLO" />
            <bitfield mask="0xFFFF0000" name="DCMPHI" />
         </register>
         <register caption="ADC Digital Comparator x Limit Value Register (x = 1 through 6)" name="ADCCMP5" offset="0x5c" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="DCMPLO" />
            <bitfield mask="0xFFFF0000" name="DCMPHI" />
         </register>
