Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/0.1/PIC32MZDA/atdf/PIC32MZ1025DAB288.atdf
         <register caption="" name="SBT10REG1" offset="0x11040" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT10REG1__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT10REG1__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT11REG0" offset="0x11420" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT11REG0__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT11REG0__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT11REG1" offset="0x11440" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT11REG1__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT11REG1__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT12REG0" offset="0x11820" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT12REG0__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT12REG0__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT13REG0" offset="0x20420" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT13REG0__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT13REG0__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT13REG1" offset="0x20440" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT13REG1__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT13REG1__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT14REG0" offset="0x20820" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT14REG0__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT14REG0__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT14REG1" offset="0x20840" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT14REG1__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT14REG1__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT15REG0" offset="0x20C20" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT15REG0__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT15REG0__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT16REG0" offset="0x34420" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT16REG0__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT16REG0__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT16REG1" offset="0x34440" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT16REG1__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT16REG1__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT16REG2" offset="0x34460" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT16REG2__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT16REG2__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT16REG3" offset="0x34480" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT16REG3__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT16REG3__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT16REG4" offset="0x344A0" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT16REG4__SIZE" />
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT16REG4__PRI" />
            <bitfield mask="0xFFFFFC00" name="BASE" />
         </register>
         <register caption="" name="SBT0RD0" offset="0x30" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT0RD0__GROUP0" />
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT0RD0__GROUP1" />
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT0RD0__GROUP2" />
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT0RD0__GROUP3" />
         </register>
         <register caption="" name="SBT0RD1" offset="0x50" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT0RD1__GROUP0" />
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT0RD1__GROUP1" />
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT0RD1__GROUP2" />
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT0RD1__GROUP3" />
         </register>
         <register caption="" name="SBT1RD0" offset="0x430" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT1RD0__GROUP0" />
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT1RD0__GROUP1" />
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT1RD0__GROUP2" />
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT1RD0__GROUP3" />
         </register>
